const dinners = [
    {
      day: "Понеділок (30 грудня 2024 року)",
      items: [
        { name: "Суп куриний з лапшою (350г)", price: 50 },
        { name: "Гуляш з гречаною кашею (300г)", price: 65 },
        { name: "Салат №1: салат з моркви по-корейськи (200г)", price: 40 },
        { name: "Салат №2: салат пекінської капусти з куркою (250г)", price: 65 },
        { name: "Хліб (60г)", price: 5 },
        { name: "Сік фруктовий без цукру (200мл)", price: 15 },
        { name: "Покласти прибори (виделка, ложка)", price: 0 },
      ],
    },
    {
      day: "Вівторок (31 грудня 2024 року)",
      items: [
        { name: "Суп овочевий (350г)", price: 50 },
        { name: "Паста з куркою та грибами (300г)", price: 65 },
        { name: "Салат №1: салат з капусти та огірків (200г)", price: 40 },
        { name: "Салат №2: салат Буніто (250г)", price: 65 },
        { name: "Хліб (60г)", price: 5 },
        { name: "Сік фруктовий без цукру (200мл)", price: 15 },
        { name: "Покласти прибори (виделка, ложка)", price: 0 },
      ],
    },
    {
      day: "Середа (01 січня 2024 року)",
      items: [
        { name: "Бульйон куриний (350г)", price: 50 },
        { name: "Плов з куркою (300г)", price: 65 },
        { name: "Салат №1: салат з буряка з сиром (200г)", price: 40 },
        { name: "Салат №2: салат Нісуаз (250г)", price: 65 },
        { name: "Хліб (60г)", price: 5 },
        { name: "Сік фруктовий без цукру (200мл)", price: 15 },
        { name: "Покласти прибори (виделка, ложка)", price: 0 },
      ],
    },
    {
      day: "Четвер (02 січня 2024 року)",
      items: [
        { name: "Борщ український (350г)", price: 50 },
        { name: "Котлета рибна та кус-кус з овочами (300г)", price: 65 },
        { name: "Салат №1: салат моркви і яблук (200г)", price: 40 },
        { name: "Салат №2: салат Цезар (250г)", price: 65 },
        { name: "Хліб (60г)", price: 5 },
        { name: "Сік фруктовий без цукру (200мл)", price: 15 },
        { name: "Покласти прибори (виделка, ложка)", price: 0 },
      ],
    },
    {
      day: "П'ятниця (03 січня 2024 року)",
      items: [
        { name: "Суп грибний (350г)", price: 50 },
        { name: "М'ясо по-гавайськи з картопляним пюре (300г)", price: 65 },
        { name: "Салат №1: салат вінегрет (200г)", price: 40 },
        { name: "Салат №2: салат з руколи, томати чері і мацарела (250г)", price: 65 },
        { name: "Хліб (60г)", price: 5 },
        { name: "Сік фруктовий без цукру (200мл)", price: 15 },
        { name: "Покласти прибори (виделка, ложка)", price: 0 },
      ],
    },
  ];
  export default dinners